In [57]:
import pandas as pd

## Series

In [58]:
data = [1, 2, 3, 4, 5]

In [59]:
s = pd.Series(data)

In [60]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [61]:
index = ['Linha' + str(i) for i in range(5)]

In [62]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [63]:
s =pd.Series(data = data, index = index)

In [64]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [65]:
data = {'Linha' + str(i) : i + 1 for i in range(5) }

In [66]:
s = pd.Series(data)

In [67]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [68]:
s1 = s + 2

In [69]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

## DataFrame

In [70]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [71]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [72]:
df1 = pd.DataFrame(data = data)

In [73]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [74]:
index = ['Linha' + str(i) for i in range(3)]

In [75]:
index

['Linha0', 'Linha1', 'Linha2']

In [76]:
df1 = pd.DataFrame(data = data, index = index)

In [77]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [78]:
columns = ['Coluna' + str(i) for i in range(3)]

In [79]:
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [80]:
df2 = pd.DataFrame(data = data, index = index, columns = columns)

In [81]:
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [82]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [83]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [84]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [85]:
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [86]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)

In [87]:
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [88]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [89]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [90]:
df1[df1 > 0] = 'A'
df1

        0  1  2
Linha0  A  A  A
Linha1  A  A  A
Linha2  A  A  A

In [91]:
df4 = pd.concat([df1, df2, df3], ignore_index)
df4

          0    1    2 Coluna0 Coluna1 Coluna2
Linha0    A    A    A     NaN     NaN     NaN
Linha1    A    A    A     NaN     NaN     NaN
Linha2    A    A    A     NaN     NaN     NaN
Linha0  NaN  NaN  NaN       B       B       B
Linha1  NaN  NaN  NaN       B       B       B
Linha2  NaN  NaN  NaN       B       B       B
Linha0  NaN  NaN  NaN       C       C       C
Linha1  NaN  NaN  NaN       C       C       C
Linha2  NaN  NaN  NaN       C       C       C

In [92]:
df4 = pd.concat([df1, df2, df3], axis = 1)
df4

        0  1  2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0  A  A  A       B       B       B       C       C       C
Linha1  A  A  A       B       B       B       C       C       C
Linha2  A  A  A       B       B       B       C       C       C